Hi @ivan-savciuc and here you go:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aiven_kafka.kafka will be created
  + resource "aiven_kafka" "kafka" {
      + cloud_name              = "aws-eu-west-1"
      + components              = (known after apply)
      + default_acl             = false
      + id                      = (known after apply)
      + maintenance_window_dow  = "sunday"
      + maintenance_window_time = "01:00:00"
      + plan                    = "business-4"
      + project                 = "project-name"
      + project_vpc_id          = "vpc-id"
      + service_host            = (known after apply)
      + service_name            = "service-name"
      + service_password        = (sensitive value)
      + service_port            = (known after apply)
      + service_type            = (known after apply)
      + service_uri             = (sensitive value)
      + service_username        = (known after apply)
      + state                   = (known after apply)
      + termination_protection  = false

      + kafka {
          + access_cert         = (sensitive value)
          + access_key          = (sensitive value)
          + connect_uri         = (sensitive value)
          + rest_uri            = (sensitive value)
          + schema_registry_uri = (sensitive value)
        }

      + kafka_user_config {
          + kafka_connect   = "true"
          + kafka_rest      = "0"
          + kafka_version   = "2.8"
          + schema_registry = "true"

          + kafka {
              + group_max_session_timeout_ms = "70000"
              + log_retention_bytes          = "1000000000"
            }

          + kafka_authentication_methods {
              + certificate = "true"
              + sasl        = "true"
            }

          + public_access {
              + kafka           = "true"
              + schema_registry = "true"
            }
        }
    }

  # aiven_kafka_acl.kafka_topics_acl[0] will be created
  + resource "aiven_kafka_acl" "kafka_topics_acl" {
      + id           = (known after apply)
      + permission   = (sensitive)
      + project      = "project-name"
      + service_name = "service-name"
      + topic        = (sensitive)
      + username     = (sensitive)
    }

  # aiven_kafka_acl.kafka_topics_acl[1] will be created
  + resource "aiven_kafka_acl" "kafka_topics_acl" {
      + id           = (known after apply)
      + permission   = (sensitive)
      + project      = "project-name"
      + service_name = "service-name"
      + topic        = (sensitive)
      + username     = (sensitive)
    }

  # aiven_kafka_connector.kafka_connect_connector will be created
  + resource "aiven_kafka_connector" "kafka_connect_connector" {
      + config         = (known after apply)
      + connector_name = "connector-name-S3-connector"
      + id             = (known after apply)
      + plugin_author  = (known after apply)
      + plugin_class   = (known after apply)
      + plugin_doc_url = (known after apply)
      + plugin_title   = (known after apply)
      + plugin_type    = (known after apply)
      + plugin_version = (known after apply)
      + project        = "project-name"
      + service_name   = "service-name"
      + task           = (known after apply)
    }

  # aiven_service_user.kafka_service_user[0] will be created
  + resource "aiven_service_user" "kafka_service_user" {
      + access_cert  = (sensitive value)
      + access_key   = (sensitive value)
      + id           = (known after apply)
      + password     = (sensitive value)
      + project      = "project-name"
      + service_name = "service-name"
      + type         = (known after apply)
      + username     = (sensitive)
    }

  # aiven_service_user.kafka_service_user[1] will be created
  + resource "aiven_service_user" "kafka_service_user" {
      + access_cert  = (sensitive value)
      + access_key   = (sensitive value)
      + id           = (known after apply)
      + password     = (sensitive value)
      + project      = "project-name"
      + service_name = "service-name"
      + type         = (known after apply)
      + username     = (sensitive)
    }

  # aws_iam_access_key.kafka_s3_connector_user_credentials will be created
  + resource "aws_iam_access_key" "kafka_s3_connector_user_credentials" {
      + create_date          = (known after apply)
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = "Active"
      + user                 = "s3-connector-user"
    }

  # aws_iam_user.kafka_s3_connector_user will be created
  + resource "aws_iam_user" "kafka_s3_connector_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "s3-connector-user"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.kafka_s3_connector_user_policy will be created
  + resource "aws_iam_user_policy" "kafka_s3_connector_user_policy" {
      + id     = (known after apply)
      + name   = "s3-connector-user-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListBucketVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::bucket"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:AbortMultipartUpload",
                          + "s3:ListMultipartUploadParts",
                          + "s3:ListBucketMultipartUploads",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::bucket/",
                          + "arn:aws:s3:::bucket/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "s3-connector-user"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aiven_kafka_cloud_name                  = "aws-eu-west-1"
  + aiven_kafka_id                          = (known after apply)
  + aiven_kafka_name                        = "service-name"
  + aiven_kafka_plan                        = "business-4"
  + aiven_kafka_project                     = "project-name"
  + aiven_kafka_service_uri                 = (sensitive value)
  + datadog_service_integration_endpoint_id = []
  + datadog_service_integration_id          = []
  + kafka_connect_config                    = (sensitive value)
  + kafka_connect_plugin_class              = (known after apply)
  + kafka_connect_plugin_title              = (known after apply)
  + kafka_connect_plugin_type               = (known after apply)
  + kafka_connect_plugin_version            = (known after apply)
  + kafka_connect_uri                       = (sensitive value)
  + kafka_host                              = (known after apply)
  + kafka_port                              = (known after apply)
  + kafka_schema_registry_uri               = (sensitive value)
  + kafka_schema_registry_uri_public        = (sensitive value)
  + kafka_termination_protection            = false

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aiven_kafka.kafka: Creating...
aws_iam_user.kafka_s3_connector_user: Creating...
aws_iam_user.kafka_s3_connector_user: Creation complete after 1s [id=s3-connector-user]
aws_iam_access_key.kafka_s3_connector_user_credentials: Creating...
aws_iam_user_policy.kafka_s3_connector_user_policy: Creating...
aws_iam_access_key.kafka_s3_connector_user_credentials: Creation complete after 1s [id=id]
aws_iam_user_policy.kafka_s3_connector_user_policy: Creation complete after 1s [id=s3-connector-user:s3-connector-user-policy]
aiven_kafka.kafka: Still creating... [10s elapsed]
aiven_kafka.kafka: Still creating... [20s elapsed]
aiven_kafka.kafka: Still creating... [30s elapsed]
aiven_kafka.kafka: Still creating... [40s elapsed]
aiven_kafka.kafka: Still creating... [50s elapsed]
aiven_kafka.kafka: Still creating... [1m0s elapsed]
aiven_kafka.kafka: Still creating... [1m10s elapsed]
aiven_kafka.kafka: Still creating... [1m20s elapsed]
aiven_kafka.kafka: Still creating... [1m30s elapsed]
aiven_kafka.kafka: Still creating... [1m40s elapsed]
aiven_kafka.kafka: Still creating... [1m50s elapsed]
aiven_kafka.kafka: Still creating... [2m0s elapsed]
aiven_kafka.kafka: Still creating... [2m10s elapsed]
aiven_kafka.kafka: Still creating... [2m20s elapsed]
aiven_kafka.kafka: Still creating... [2m30s elapsed]
aiven_kafka.kafka: Still creating... [2m40s elapsed]
aiven_kafka.kafka: Still creating... [2m50s elapsed]
aiven_kafka.kafka: Still creating... [3m0s elapsed]
aiven_kafka.kafka: Still creating... [3m10s elapsed]
aiven_kafka.kafka: Still creating... [3m20s elapsed]
aiven_kafka.kafka: Still creating... [3m30s elapsed]
aiven_kafka.kafka: Still creating... [3m40s elapsed]
aiven_kafka.kafka: Still creating... [3m50s elapsed]
aiven_kafka.kafka: Still creating... [4m0s elapsed]
aiven_kafka.kafka: Still creating... [4m10s elapsed]
aiven_kafka.kafka: Still creating... [4m20s elapsed]
aiven_kafka.kafka: Still creating... [4m30s elapsed]
aiven_kafka.kafka: Still creating... [4m40s elapsed]
aiven_kafka.kafka: Still creating... [4m50s elapsed]
aiven_kafka.kafka: Creation complete after 5m0s [id=project-name/service-name]
aiven_service_user.kafka_service_user[0]: Creating...
aiven_service_user.kafka_service_user[1]: Creating...
aiven_kafka_connector.kafka_connect_connector: Creating...
aiven_service_user.kafka_service_user[0]: Creation complete after 1s [id=project-name/service-name/user1]
aiven_service_user.kafka_service_user[1]: Creation complete after 1s [id=project-name/service-name/user2]
aiven_kafka_acl.kafka_topics_acl[0]: Creating...
aiven_kafka_acl.kafka_topics_acl[1]: Creating...
aiven_kafka_acl.kafka_topics_acl[0]: Creation complete after 0s [id=project-name/service-name/acl-1]
aiven_kafka_acl.kafka_topics_acl[1]: Creation complete after 0s [id=project-name/service-name/acl-2]
╷
│ Error: 503: {"errors":[{"message":"Service Unavailable","status":503}],"message":"Service Unavailable"} -
│
│   with aiven_kafka_connector.kafka_connect_connector,
│   on main.tf line 87, in resource "aiven_kafka_connector" "kafka_connect_connector":
│   87: resource "aiven_kafka_connector" "kafka_connect_connector" {
│
╵
Releasing state lock. This may take a few moments...
ERRO[0318] Hit multiple errors:
Hit multiple errors:
exit status 1
```